#ifndef __TEA_h__
#define __TEA_h__

#include "types.h"

/********************************************************************* 
*                           函数 
**********************************************************************/  
  

  
/********************************************************************* 
*                           加密算法 
*参数:src:源数据,所占空间必须为8字节的倍数.加密完成后密文也存放在这 
*     size_src:源数据大小,单位字节 
*     key:密钥,16字节 
*返回:密文的字节数 
**********************************************************************/  
  
extern uint16 encrypt(uint8 *src,uint16 size_src,uint8 *key);  
  
/********************************************************************* 
*                           解密算法 
*参数:src:源数据,所占空间必须为8字节的倍数.解密完成后明文也存放在这 
*     size_src:源数据大小,单位字节 
*     key:密钥,16字节 
*返回:明文的字节数,如果失败,返回0 
**********************************************************************/  
  
extern uint16 decrypt(uint8 *src,uint16 size_src,uint8 *key);  
  

#endif  /*__TEA_h__*/